brew "python@3.13"
brew "rust"
brew "go"
brew "ruby"
brew "zig"
brew "hyperfine"
brew "lua"
brew "luajit"
brew "odin"
brew "elixir"
brew "chezscheme"
brew "mawk"
brew "gnucobol"
brew "vlang"
brew "dart-sdk"
cask "dotnet-sdk9"
brew "dotnet@9"
brew "julia"
brew "haskell-stack"
brew "kotlin"
cask "kotlin-native"
